In [5]:
import pandas as pd

In [6]:
# Excercise 1

In [7]:
authors = pd.DataFrame({
    'author_id': [i + 1 for i in range(3)],
    'author_name': ['Тургенев', 'Чехов', 'Островский']
})

In [27]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [11]:
books = pd.DataFrame({
    'author_id': [1, 1, 1, 2, 2, 3, 3],
    'book_title': [
        'Отцы и дети',
        'Рудин',
        'Дворянское гнездо',
        'Толстый и тонкий',
        'Дама с собачкой',
        'Гроза', 'Таланты и поклонники'
    ],
    'price': [450, 300, 350, 500, 450, 370, 290]
})

In [26]:
books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [ ]:
# Excercise 2

In [17]:
authors_price = authors.join(books.set_index('author_id'), on='author_id')

In [25]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
0          1    Тургенев                 Рудин    300
0          1    Тургенев     Дворянское гнездо    350
1          2       Чехов      Толстый и тонкий    500
1          2       Чехов       Дама с собачкой    450
2          3  Островский                 Гроза    370
2          3  Островский  Таланты и поклонники    290

In [20]:
# Excercise 3

In [21]:
top5 = authors_price.nlargest(5, 'price')

In [23]:
top5

   author_id author_name         book_title  price
1          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
1          2       Чехов    Дама с собачкой    450
2          3  Островский              Гроза    370
0          1    Тургенев  Дворянское гнездо    350

In [24]:
# Exercise 4

In [39]:
authors_min_price = authors_price.groupby('author_name').agg({'price': 'min'}).rename(columns={'price':'min_price'})

In [40]:
authors_min_price

             min_price
author_name
Островский         290
Тургенев           300
Чехов              450

In [41]:
authors_max_price = authors_price.groupby('author_name').agg({'price': 'max'}).rename(columns={'price':'max_price'})

In [42]:
authors_max_price

             max_price
author_name
Островский         370
Тургенев           450
Чехов              500

In [43]:
authors_mean_price = authors_price.groupby('author_name').agg({'price': 'mean'}).rename(columns={'price':'mean_price'})

In [44]:
authors_mean_price

             mean_price
author_name
Островский   330.000000
Тургенев     366.666667
Чехов        475.000000

In [46]:
authors_stat = pd.concat([authors_min_price, authors_max_price, authors_mean_price], axis=1)

In [47]:
authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000